; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v3 - type_1 ?v4 - type_3)
 	      (pred_3 ?v6 - object ?v4 - type_3)
	      (pred_4 ?v3 - type_1 ?v8 - type_2)
	      (pred_2 ?v3 - type_1 ?v6 - object ?v8 - type_2))

   (:action op_1
       :parameters  (?v3 - type_1 ?v5 ?v2 - type_3)
       :precondition (and  (pred_1 ?v3 ?v5))
       :effect (and  (pred_1 ?v3 ?v2)
		     (not (pred_1 ?v3 ?v5))))

   (:action op_3
       :parameters (?v3 - type_1 ?v1 - object ?v7 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v7) (pred_1 ?v3 ?v7) (pred_4 ?v3 ?v8))
       :effect (and (pred_2 ?v3 ?v1 ?v8)
		    (not (pred_3 ?v1 ?v7)) 
		    (not (pred_4 ?v3 ?v8))))

   (:action op_2
       :parameters (?v3 - type_1 ?v1 - object ?v7 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_2 ?v3 ?v1 ?v8) (pred_1 ?v3 ?v7))
       :effect (and (pred_3 ?v1 ?v7)
		    (pred_4 ?v3 ?v8)
		    (not (pred_2 ?v3 ?v1 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_10 obj_09 - type_1
obj_07 obj_12 obj_06 obj_03 - type_2
obj_01 obj_08 obj_05 - type_3
obj_04 obj_02 obj_11 - object)
(:init
(pred_1 obj_10 obj_01)
(pred_4 obj_10 obj_07)
(pred_4 obj_10 obj_12)
(pred_1 obj_09 obj_01)
(pred_4 obj_09 obj_06)
(pred_4 obj_09 obj_03)
(pred_3 obj_04 obj_05)
(pred_3 obj_02 obj_05)
(pred_3 obj_11 obj_08)
)
(:goal
(and
(pred_3 obj_04 obj_08)
(pred_3 obj_02 obj_05)
(pred_3 obj_11 obj_08)
)
)

(:constraints
  (always (not (pred_1 obj_10 obj_05)))
)
)

; plan
1. (op_1 obj_10 obj_01 obj_08)
   deleted: (pred_1 obj_10 obj_01)
   added: (pred_1 obj_10 obj_08)
   goals met: 2 of 3
2. (op_1 obj_09 obj_01 obj_05)
   deleted: (pred_1 obj_09 obj_01)
   added: (pred_1 obj_09 obj_05)
   goals met: 2 of 3
3. (op_3 obj_09 obj_04 obj_05 obj_03)
   deleted: (pred_3 obj_04 obj_05) (pred_4 obj_09 obj_03)
   added: (pred_2 obj_09 obj_04 obj_03)
   goals met: 2 of 3
4. (op_1 obj_09 obj_05 obj_08)
   deleted: (pred_1 obj_09 obj_05)
   added: (pred_1 obj_09 obj_08)
   goals met: 2 of 3
5. (op_2 obj_09 obj_04 obj_08 obj_03)
   deleted: (pred_2 obj_09 obj_04 obj_03)
   added: (pred_3 obj_04 obj_08) (pred_4 obj_09 obj_03)
   goals met: 3 of 3
